routes/web.php

SELECT * FROM `posts`
---

Route::get('/', [PostController::class, 'index']);

Route::get('posts/{post:slug}',[PostController::class, 'show']);