app/Http/Controllers/AdminPostController.php

    public function index()
    {

        return view('admin.posts.index', [
            'posts' => Post::paginate()

        ]);
---
SELECT * FROM `posts` LIMIT 50 offset 0
SELECT count(*) as aggregate FROM `posts`

    public function destroy(Post $post)
    {
        $post->delete();
---
DELETE FROM `posts` WHERE `id` = 10