app/Http/Controllers/PostController.php

SELECT * FROM `categories` WHERE `categories`.`id` in (2, 3, 4)
SELECT count(*) as aggregate FROM `posts`
---
    public function index(){

   return view('posts.index', [
            // 'posts' => Post::latest()->with('category', 'author')->get()
            'posts' => Post::latest()->filter(request(['search','category','author']))->paginate(4)->withQueryString(),