app/Http/Controllers/RegisterController.php

INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('asekhame@gmail.com', 'asekhame@gmail.com', 'asekhame@gmail.com', '$2y$12$TTsRHrGhxQj1NATb4JN2PemMinjwZtR7lnB/Z19cGjbYJiA2CR45W', '2024-05-02 23:24:45', '2024-05-02 23:24:45')
---
    public function store(){
        $attributes = request()->validate([
            'name' => 'required|min:3|max:10',
            'username' => 'required|min:5|max:10|unique:users,username',
            'email' => 'required|email|unique:users,email',
            'password' => 'required'
        ]);

        //create the user in the database
        $user = User::create($attributes);